docs/problem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-21 Mon 12:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Problem</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Warren Wilkinson" />
<link rel="stylesheet"
                  href="../files/style.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">The Problem</h1>
<p>
I think a story could be told around the scale of the
problem&#x2026; breaking it down into the sub parts&#x2026;
</p>

<p>
<a href="https://www.bcemissions.ca/go/city/Coquitlam/index.html">https://www.bcemissions.ca/go/city/Coquitlam/index.html</a>
<a href="https://www.bcemissions.ca/go/city/Port_Coquitlam/index.html">https://www.bcemissions.ca/go/city/Port_Coquitlam/index.html</a>
<a href="https://www.bcemissions.ca/go/city/Port_Moody/index.html">https://www.bcemissions.ca/go/city/Port_Moody/index.html</a>
</p>

<p>
The above is a good starting point. Basically, I want to get the data
on the populations (because per-capita is important).
</p>

<p>
I also want to demonstrate land use, because this is the range of
options we have for local food, expansion, etc.
</p>

<p>
Then, breakdown into housing types.. because they have different energy profiles.
</p>
<ul class="org-ul">
<li>Should be able to get exact numbers for this.</li>
</ul>

<p>
Then, lets talk about the heating and electricity used&#x2026; this varies with housing type.
</p>
<ul class="org-ul">
<li>I can really only get BC averages for this.  That's probably reasonable. I don't think
any of the tri-cities is significantly better/worse efficiency ratings for houses than other places
in BC.</li>
<li>This leads to an option for exploration &#x2013; what if we could change our housing profile?</li>
</ul>

<p>
Then, commutes&#x2026; what type, how far.
</p>
<ul class="org-ul">
<li>Can't seem to get exact numbers &#x2013; have to let the user decide if we're more
like Vancouver, or more like Mission.</li>
<li>This leads to an option &#x2013; what if we could increase the number of people living AND working in 
tri-cities&#x2026;.</li>
</ul>

<p>
Then solid waste
</p>
<ul class="org-ul">
<li>CO2 produced&#x2026; what about the cost of transporting it?  How much is compost and where does that go?</li>
<li>What about human body waste &#x2013; e.g. sewage&#x2026; does this produce CO2?  What do we do with it at treatment?</li>
</ul>

<p>
Then air quality
</p>
<ul class="org-ul">
<li>How is our air?</li>
<li>What happens if we have more electric cars or walking?</li>
</ul>

<div id="outline-container-org901116f" class="outline-2">
<h2 id="org901116f">Populations</h2>
<div class="outline-text-2" id="text-org901116f">
<p>
<a href="https://www2.gov.bc.ca/gov/content/data/statistics/people-population-community/population">https://www2.gov.bc.ca/gov/content/data/statistics/people-population-community/population</a>
</p>
</div>
</div>


<div id="outline-container-orgb57da48" class="outline-2">
<h2 id="orgb57da48">Land Use</h2>
<div class="outline-text-2" id="text-orgb57da48">
<p>
Agricultural Land Reserve
<a href="https://www.alc.gov.bc.ca/alc/content/alr-maps/maps-and-gis">https://www.alc.gov.bc.ca/alc/content/alr-maps/maps-and-gis</a>
</p>
</div>
</div>

<div id="outline-container-org6b99f59" class="outline-2">
<h2 id="org6b99f59">Housing types</h2>
<div class="outline-text-2" id="text-org6b99f59">
<p>
Not sure where to get this information.
</p>
</div>
</div>


<div id="outline-container-org0f9e7d7" class="outline-2">
<h2 id="org0f9e7d7">Heating and Electricity</h2>
<div class="outline-text-2" id="text-org0f9e7d7">
<p>
Residential
Commercial Small/Medium
Large Industrial
Wholesale?
</p>

<p>
(For categories, Elec, Natural Gas, Heating Oil, Propane)
</p>

<p>
<a href="http://oee.nrcan.gc.ca/corporate/statistics/neud/dpa/menus/trends/comprehensive_tables/list.cfm">http://oee.nrcan.gc.ca/corporate/statistics/neud/dpa/menus/trends/comprehensive_tables/list.cfm</a>
</p>
</div>
</div>

<div id="outline-container-org579fd20" class="outline-2">
<h2 id="org579fd20">Commuting</h2>
<div class="outline-text-2" id="text-org579fd20">
<p>
The best I can do is Data tables, 2016 Census
Main Mode of Commuting (20), Commuting Duration (7), Time Leaving for Work (7), Sex (3) and Age (11B) for the Employed Labour Force Aged 15 Years and Over Having a Usual Place of Work or No Fixed Workplace Address, in Private Households of Canada, Provinces and Territories, Census Metropolitan Areas and Census Agglomerations, 2016 Census - 25% Sample Data 
</p>

<p>
I think if I sort of 'blend' the profiles for Vancouver and Mission/Abbotsford I can come up with some kind of reasonable guess.  This would have to be a slider.
</p>

<p>
'Assuming Tri-Cities are more like Vancouver &#x2014; More like Abbotsford'
</p>

<p>
<a href="https://www12.statcan.gc.ca/census-recensement/2016/dp-pd/index-eng.cfm">https://www12.statcan.gc.ca/census-recensement/2016/dp-pd/index-eng.cfm</a>
</p>


<p>
He showed it as a commute distance chart&#x2026; 
This data also varies with time&#x2026; 2006 and 2016 we have.
</p>

<p>
They also showed a chart of commute modes.
</p>
</div>
</div>

<div id="outline-container-org5880c65" class="outline-2">
<h2 id="org5880c65">Solid Waste</h2>
<div class="outline-text-2" id="text-org5880c65">
<p>
They explained solid waste produced and the CO2 generated from that solid waste.
</p>
</div>
</div>

<div id="outline-container-orgef1dcf0" class="outline-2">
<h2 id="orgef1dcf0">Air Quality</h2>
<div class="outline-text-2" id="text-orgef1dcf0">
<p>
They showed fine particulate matter.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Warren Wilkinson</p>
<p class="date">Created: 2019-10-21 Mon 12:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
